app/controllers/movies_controller.rb

  def update
    if @movie.update(movie_params)
---
UPDATE "movies" SET "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "movies"."id" = 9  [["image_file_name", "photo_portfolio.png"], ["image_file_size", 327280], ["image_updated_at", Fri, 04 Oct 2013 19:11:18 UTC +00:00], ["updated_at", Fri, 04 Oct 2013 19:11:18 UTC +00:00]]

  def create
    @movie = Movie.new(movie_params)
    if @movie.save
---
INSERT INTO "movies" ("cast", "created_at", "description", "director", "duration", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "rating", "released_on", "title", "total_gross", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def set_movie
    @movie = Movie.find(params[:id])
---
SELECT "movies".* FROM "movies" WHERE (released_on <= '2013-10-01 03:46:36.774458') ORDER BY released_on desc