app/controllers/reviews_controller.rb

	def destroy
		@review = @movie.reviews.find_by(id: params[:id])
		if @review.destroy
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ? AND "reviews"."id" = 1 LIMIT 1  [["movie_id", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 1]]